<template>
    <div class="textResult">
        <div class="top">
            <van-divider :style="{ color: '#fff', borderColor: '#fff', padding: '0 16px' }">测试结果</van-divider>
        </div>
        <div class="main_box">
            <div class="main">
                <h3>ISFJ</h3>
                <p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p>
                <p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p><p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p><p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p><p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p><p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p><p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p><p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p><p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。
                    16种个世界上最完善的心理测量工具之一。16种个世界
                </p>
                <p>世界上最完善的心理测量工具之一。之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个</p>
                <p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个</p>
                <p>世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个</p>
                <p>世界上最完善的心理测量工具之一。16种个世界上最完具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个</p>
                <p>世界上最完善的心理测量工具之心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个世界上最完善的心理测量工具之一。16种个</p>
            </div>
        </div>
        
    </div>
</template>

<style lang="less" scoped>
    .textResult{
        height: 100vh;
        background: #6692FF;
        text-align: left;
        box-sizing: border-box;
        padding: 0 30px;
        .top{
            padding: 15px 0;
            font-size: 16px;
            margin-bottom: 14px;
        }
        .main_box{
            background: #fff;
            border-radius: 4px;
            padding: 20px 20px 18px;
            height: 550px;
             overflow-y: scroll;
            .main{
                h3{
                    text-align: center;
                    margin-bottom: 6px;
                }
                p{
                    color: #666;
                    font-size: 14px;
                }
            }
        }
    }
</style>